# Práctica del Módulo 1.

Estimados todos....! Sean todos bienvenidos a la actividad práctica del Módulo 1...
El objetivo de la dinámica es:

- Escoger un conjunto de datos, describirlo, contextualizarlo, definirlo.... (Por favor decir de dónde obtienen los datos...)
- Usar algunas de la técnicas que aprendimos esta semana para ordenar, clasificar, arreglar datos y hacer un análisis exploratorio tanto estadístico básico como visual de los datos..
- Enfocarse en alguna(s) variable(s) de interés y hacer una storytelling (en una diapositiva de power point o canva) para comunicar y socializar el ejercicio.
- Una pequeña presentación de algunos minutos que describa el trabajo que hicieron y describa la storytelling que hicieron.

Estoy acá para cualquier duda, inquietud, problema, etc.... El trabajo será independiente o en grupo, podemos usar el chat para comunicarlnos...!

In [15]:
import pandas as pd

In [19]:
algo=pd.read_csv("cities_csv1-Copy1.csv",on_bad_lines="skip")

In [20]:
algo=algo[["Date","AZ-Phoenix","CA-Los Angeles","CA-San Diego"]]

In [22]:
algo=algo[["AZ-Phoenix","CA-Los Angeles","CA-San Diego","Date"]]

In [23]:
algo

     AZ-Phoenix  CA-Los Angeles  CA-San Diego        Date
0           NaN           59.33         54.67  1987-01-01
1           NaN           59.65         54.89  1987-02-01
2           NaN           59.99         55.16  1987-03-01
3           NaN           60.81         55.85  1987-04-01
4           NaN           61.67         56.35  1987-05-01
..          ...             ...           ...         ...
342      154.82          238.27        215.22  2015-08-01
343      155.15          238.68        216.37  2015-09-01
344      155.92          238.91        215.62  2015-10-01
345      156.42          239.67        216.54  2015-11-01
346      157.22          240.54        218.00  2015-12-01

[347 rows x 4 columns]

In [ ]:
Nota_math_f,Nota_read_f,Nota_write_f,grade=[],[],[],[]
Nota_math_m,Nota_read_m,Nota_write_m=[],[],[]

for i in datos["race/ethnicity"].unique():
    grade.append(i)
    Nota_math_f.append(datos[(datos["race/ethnicity"]==i)&(datos["gender"]=="female")]["math score"].mean())
    Nota_read_f.append(datos[(datos["race/ethnicity"]==i)&(datos["gender"]=="female")]["reading score"].mean())
    Nota_write_f.append(datos[(datos["race/ethnicity"]==i)&(datos["gender"]=="female")]["writing score"].mean())
    Nota_math_m.append(datos[(datos["race/ethnicity"]==i)&(datos["gender"]=="male")]["math score"].mean())
    Nota_read_m.append(datos[(datos["race/ethnicity"]==i)&(datos["gender"]=="male")]["reading score"].mean())
    Nota_write_m.append(datos[(datos["race/ethnicity"]==i)&(datos["gender"]=="male")]["writing score"].mean())

mpl.figure()
mpl.plot(grade,Nota_math_f,label="math female",linestyle="-")
mpl.plot(grade,Nota_read_f,label="read female",linestyle="-")
mpl.plot(grade,Nota_write_f,label="write female",linestyle="-")
mpl.plot(grade,Nota_math_m,label="math male",linestyle="--")
mpl.plot(grade,Nota_read_m,label="read male",linestyle="--")
mpl.plot(grade,Nota_write_m,label="write male",linestyle="--")
mpl.legend()
mpl.show()

In [ ]:
len(datos[datos["gender"]=="Male"])